[{"title":"Increasing Typing Speed","content":"As someone who spends most of their time in front of a computer, and as someone who enjoys efficiency, increasing my typing speed is essential. It was not until I graduated that I looked at the way I typed. My typing speed is in the range of an average professional typist (50 to 80 WPM [ref](https://en.wikipedia.org/wiki/Words_per_minute \"Wikipedia Words per Minute\")). But, the way I typed was inefficient. I didn't use my pinky fingers much and often moved my hands along the keyboard to reach keys.\n\nI found a few websites that others used for typing. The first was [KeyBR](https://www.keybr.com/ \"KeyBR typing site\"). The method used on this website was unique. It slowly introduced letters as you completed passages with high accuracy. Letters followed similar rules to the English language. For example, the letter 'q' would almost always be followed by the letter 'u.'\n\n![Typing Speed KeyBR](//images.ctfassets.net/96ovba1yjdbm/5T3jugW7IroVw9UUycK5Qc/68c340ae5aa4fe24dd5f694843d2f2fc/typingspeed.PNG)\n\nI used this website a lot when I was first working on my positioning and finger accuracy. I made sure to use the correct finger for the specific key. In the image above, you can see my typing speed was slow. This initial slow speed could be partly due to allowing punctuation to the tests (a comma, period, exclamation, or dash after each word), which I removed later.\n\n![Typing Speed Compare](//images.ctfassets.net/96ovba1yjdbm/65bkH0HTr88DNSDZltYcrH/90b2ccdaafe9b22fc37789171588f795/typingspeedcompare.PNG)\n\nAs I worked on typing each day, I noticed my top speed and average speeds slowly raised. As of October 1, 2020, I have reached a top speed of 79.6 and have an average speed of 49.1. This low average is due to the start of my typing journey. My average typing speed, I feel, is more around 60 WPM now.\n\nThe second website I use is [10FastFingers](https://10fastfingers.com/typing-test/english \"10FastFingers typing test\"). This website has typing tests and typing speed competitions. The tests use the most common X words in the language of your choice. You are given one minute to type as many words as you can. I don't often use this website for typing practice, but to finish my typing practice for the day.\n\n![10FastFingers Typing Speed](//images.ctfassets.net/96ovba1yjdbm/Pjl4awO1e76wsTrtKFAVS/30f0c96a22cbdb78c212216edd1ef799/fastfiongerstypingspeed.PNG)\n\nUnsurprisingly, I have noticed a few things as I work on typing.\n\n- Eating and consuming caffeine before practice dramatically reduces the number of errors and increases your speed. I usually worked on typing first thing in the morning. It was quite interesting to see the difference in speed and errors from consuming coffee and eating an apple before practicing.\n- Working on accuracy over speed showed more results. I noticed this difference in other things like FPS training, and it showed in typing. Typing is partly muscle memory, and just typing as fast as you can increases errors, not speed.\n- KeyBr and 10FastFingers do not help developers much since many programming languages require you to type numbers and terminating / bracket characters.","icon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"96ovba1yjdbm"}},"id":"6bxLVEgLRVaNIt7VUjaWup","type":"Asset","createdAt":"2020-10-01T19:31:20.705Z","updatedAt":"2020-10-01T20:38:47.029Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"locale":"en-US"},"fields":{"title":"Keyboard White Background","description":"Photo by Olenka Sergienko from Pexels","file":{"url":"//images.ctfassets.net/96ovba1yjdbm/6bxLVEgLRVaNIt7VUjaWup/2658c4a7c063ac37486051112c538f69/undefined","details":{"size":36380,"image":{"width":640,"height":318}},"fileName":"pexels-olenka-sergienko-1772123.jpg","contentType":"image/jpeg"}}},"imageAlt":"Keyboard White Background","path":"increasing-typing-speed","updatedAt":"2020-10-01T20:40:40.719Z"},{"title":"Aim Training","content":"As a gamer, I often am still in front of a computer in my downtime. I used to play League of Legends for years. This game required more game knowledge and positioning over mouse accuracy. It was also a very frustrating game that had me uninstalling to later reinstall, sometimes on the same day.\n\nI finally dropped it and picked up FPS games like Valorant and Apex Legends. I got better at those two games but would still get rolled by decent opponents. I first downloaded Aim Lab after seeing a streamer play it (don't remember which one. Mande, I think). I found it helped me improve in some areas.\n\nOn September 21, 2020, I tried Kovaak's. Some scenarios in Kovaak's aim trainer were absurd. It showed how much my click-timing and tracking were below average. I joined the discord channel that day and learned about Aimer7 and Sparky.\n\nAimer7 has several papers written about improving in different areas of FPS games. The main one is \"Aim Workout Routines.\" This paper covers Kovaak's scenarios for each experience level, and mouse sensitivities to use (in cm/360 or inch/360) depending on your goals.\n\nSparky's discord has a recourse section with scenarios to work on and benchmarks scenarios for a tier system. I was placed in bronze (the lowest rank) after completing the benchmarks. This placement reassured me that I needed work.\n\nSince the 21st, I have been working on Aimer7's routines and have seen significant improvement in Kovaak's Aim Trainer, but only marginal improvement in Apex Legends. Kovaak's does not train your game knowledge and recoil control. You can track an enemy correctly with your cursor, but as soon as you shoot, you miss from the recoil. Practicing with the in-game training or shooting ranges and aim training in Kovaak's before playing seems to work best.","icon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"96ovba1yjdbm"}},"id":"3xmOiObKkc1j7YqiW1XQnc","type":"Asset","createdAt":"2020-10-01T19:41:26.058Z","updatedAt":"2020-10-01T20:24:23.770Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"locale":"en-US"},"fields":{"title":"Kovaak's Aim Trainer Icon","file":{"url":"//images.ctfassets.net/96ovba1yjdbm/3xmOiObKkc1j7YqiW1XQnc/c1f3cb217983b2e73083c84fcf446fd5/e8d56881b25e834f3abffa4b780e673d-768x432.png","details":{"size":87992,"image":{"width":640,"height":360}},"fileName":"e8d56881b25e834f3abffa4b780e673d-768x432.png","contentType":"image/png"}}},"imageAlt":"Kovaak's Aim Trainer","path":"aim-training","updatedAt":"2020-10-01T19:59:10.252Z"}]